Programming/transaction-limitter.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-28 일 14:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="U-SGITGLAP01\admin" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf9daa35">1. Table of Contents</a></li>
<li><a href="#org916e595">2. What's Transaction Limitter?</a></li>
<li><a href="#org8bba982">3. Why do we need Transaction Limitter?</a></li>
<li><a href="#orgf7e6cc0">4. How to develop Transaction Limitter?</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf9daa35" class="outline-2">
<h2 id="orgf9daa35"><span class="section-number-2">1.</span> Table of Contents</h2>
<div class="outline-text-2" id="text-1">
<p>
DRAFT
</p>
</div>
</div>

<div id="outline-container-org916e595" class="outline-2">
<h2 id="org916e595"><span class="section-number-2">2.</span> What's Transaction Limitter?</h2>
<div class="outline-text-2" id="text-2">
<p>
Transaction Limiter makes sure you don't accidentally send more orders than you're allowed to.
</p>
</div>
</div>

<div id="outline-container-org8bba982" class="outline-2">
<h2 id="org8bba982"><span class="section-number-2">3.</span> Why do we need Transaction Limitter?</h2>
<div class="outline-text-2" id="text-3">
<p>
For a fair trading environemt and to protect individual traders, Many global exchanges constraints a total count of order request a market participant can send in a fixed duration.
Crypto exchanges tend to apply a more strict restriction.
</p>

<p>
A severe punishment can be followed if you break this rule.
For example, you'll be probably prohibited from trading for a couple of hours, if it's the first time.
If <i>the mistake</i> continues, there's a risk that you'll get banned from the exchange for LONG (3 months, 6 months, or forever).
</p>

<p>
This is not good.
It's probably a good decision to ban those because they aren't in control, obviously.
</p>

<p>
//info box?
In my opinion, it's an interesting project to implement a limiter class, not only in the trading industry but in general!
The implementation can be generic such that you can control certain tasks to be executed in a fixed window.
//info box end
</p>

<div class="info" id="orgbc83939">
<p>
<b>Info example</b> <br />
Did you know&#x2026;
</p>

</div>

<div class="tip" id="orgdbcfb25">
<p>
<b>Tip example</b> <br />
Try doing it this way&#x2026;
</p>

</div>

<p>
A note box is displayed as follows:
</p>

<div class="note" id="orgdea1f8f">
<p>
<b>Note example</b> <br />
This is a useful note&#x2026;
</p>

</div>

<p>
A note box is displayed as follows:
</p>

<div class="note" id="org10ce14c">
<p>
<b>Note example</b> <br />
This is a useful note&#x2026;
</p>

</div>


<p>
A warning box is displayed as follows:
</p>

<div class="warning" id="orgd530912">
<p>
<b>Warning example</b> <br />
Be careful!  Check that you have&#x2026;
</p>

</div>

<blockquote>
<p>
Let us change our traditional attitude to the construction of programs:
Instead of imagining that our main task is to instruct a computer what to do,
let us concentrate rather on explaining to human beings what we want a
computer to do.
</p>

<p>
The practitioner of literate programming can be regarded as an essayist, whose
main concern is with exposition and excellence of style. Such an author, with
thesaurus in hand, chooses the names of variables carefully and explains what
each variable means. He or she strives for a program that is comprehensible
because its concepts have been introduced in an order that is best for human
understanding, using a mixture of formal and informal methods that reinforce
each other.
</p>

<p>
&#x2014; Donald Knuth
</p>
</blockquote>
</div>
</div>






<div id="outline-container-orgf7e6cc0" class="outline-2">
<h2 id="orgf7e6cc0"><span class="section-number-2">4.</span> How to develop Transaction Limitter?</h2>
<div class="outline-text-2" id="text-4">
<p>
#+begin<sub>example</sub>
</p>

<p>
#+end<sub>exampleo</sub>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: U-SGITGLAP01\admin</p>
<p class="date">Created: 2024-04-28 일 14:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
